src/cf/InformationRegisters/otus_СообщенияКОтправке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>otus_СообщенияКОтправке</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Обработано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОбработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Соединение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.otus_Соединения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяОчереди</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/otus_НаправленияОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>otus_НаправленияОбмена</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отправка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Получение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/otus_Соединения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>otus_Соединения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Активно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УсловиеВыгрузки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяОчереди</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаправлениеОбмена</Name>
							<Type>
								<v8:Type>cfg:EnumRef.otus_НаправленияОбмена</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/otus_Интеграция/Ext/Module.bsl
Процедура otus_РегистрацияИзмененийПриЗаписи(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ВремяНачалаЗамера = ОценкаПроизводительности.НачатьЗамерВремени();
	
	ТекущийПривилегированныйРежим = ПривилегированныйРежим();  
	УстановитьПривилегированныйРежим(Истина);
	
	ТипОбъекта = Источник.Метаданные().ПолноеИмя();
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	otus_СоединенияСостав.Ссылка КАК Соединение,
	                      |	otus_СоединенияСостав.УсловиеВыгрузки КАК УсловиеВыгрузки,
						  |	otus_СоединенияСостав.ИмяОчереди КАК ИмяОчереди
	                      |ИЗ
	                      |	Справочник.otus_Соединения.Состав КАК otus_СоединенияСостав
	                      |ГДЕ
	                      |	otus_СоединенияСостав.Ссылка.Активно
	                      |	И otus_СоединенияСостав.Активно
	                      |	И otus_СоединенияСостав.ТипОбъекта = &ТипОбъекта
						  |	И otus_СоединенияСостав.НаправлениеОбмена = ЗНАЧЕНИЕ(Перечисление.otus_НаправленияОбмена.Отправка)");
	Запрос.УстановитьПараметр("ТипОбъекта", ТипОбъекта);
	
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;	
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		УсловиеВыполнено = Ложь;
		Если НЕ ПустаяСтрока(Выборка.УсловиеВыгрузки) Тогда
			УсловиеВыполнено = otus_ОбщегоНазначения.ПроверкаВыполненияУсловия(Источник, Выборка.УсловиеВыгрузки);
		КонецЕсли;
		
		Если УсловиеВыполнено Тогда 
			
			МенеджерЗаписи = РегистрыСведений.otus_СообщенияКОтправке.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Соединение = Выборка.Соединение;
			МенеджерЗаписи.Объект = Источник.Ссылка;
			МенеджерЗаписи.ИмяОчереди = Выборка.ИмяОчереди;
			//МенеджерЗаписи.ТекстСообщения = ТекстСообщения;
			МенеджерЗаписи.ИдентификаторЗаписи = Новый УникальныйИдентификатор();
			
			МенеджерЗаписи.Записать(Истина);
			
		КонецЕсли;
				
	КонецЦикла;
	
    УстановитьПривилегированныйРежим(ТекущийПривилегированныйРежим);
	
	ОценкаПроизводительности.ЗакончитьЗамерВремени("РегистрацияКОбменуKafka", ВремяНачалаЗамера);
	
КонецПроцедуры

Процедура otus_ОтправитьСообщения() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
						  |	otus_СообщенияКОтправке.Соединение КАК Соединение,
	                      |	otus_СообщенияКОтправке.Объект КАК Объект,
	                      |	otus_Соединения.Адрес КАК Адрес,
						  |	otus_СообщенияКОтправке.ИмяОчереди КАК Топик,
						  |	otus_СообщенияКОтправке.ИдентификаторЗаписи КАК ИдентификаторЗаписи
						  |ПОМЕСТИТЬ ВТ_ДанныеКОтправке
	                      |ИЗ
	                      |	РегистрСведений.otus_СообщенияКОтправке КАК otus_СообщенияКОтправке
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.otus_Соединения КАК otus_Соединения
	                      |		ПО otus_СообщенияКОтправке.Соединение = otus_Соединения.Ссылка
	                      |ГДЕ
	                      |	НЕ otus_СообщенияКОтправке.Обработано
						  |;
						  |ВЫБРАТЬ
						  |	ВТ_ДанныеКОтправке.Адрес КАК Адрес,
						  |	ВТ_ДанныеКОтправке.Топик КАК Топик,
						  |	АВТОНОМЕРЗАПИСИ() КАК НомерГруппы
						  |ПОМЕСТИТЬ ВТ_Группировка
						  |ИЗ
						  |	ВТ_ДанныеКОтправке КАК ВТ_ДанныеКОтправке
						  |СГРУППИРОВАТЬ ПО
						  |	ВТ_ДанныеКОтправке.Адрес,
						  |	ВТ_ДанныеКОтправке.Топик	
						  |;
						  |ВЫБРАТЬ
						  |	ВТ_ДанныеКОтправке.Соединение КАК Соединение,
	                      |	ВТ_ДанныеКОтправке.Объект КАК Объект,
						  |	ВТ_ДанныеКОтправке.Адрес КАК Адрес,
						  |	ВТ_ДанныеКОтправке.Топик КАК Топик,
						  |	ВТ_ДанныеКОтправке.ИдентификаторЗаписи КАК ИдентификаторЗаписи
						  |ИЗ
						  |	ВТ_ДанныеКОтправке КАК ВТ_ДанныеКОтправке
						  |	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Группировка КАК ВТ_Группировка
						  |		ПО ВТ_Группировка.Адрес = ВТ_ДанныеКОтправке.Адрес
						  |		И ВТ_Группировка.Топик = ВТ_ДанныеКОтправке.Топик
						  |
						  |ИТОГИ МАКСИМУМ(Адрес), МАКСИМУМ(Топик)
						  |	ПО ВТ_Группировка.НомерГруппы");
	Результат = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Если Результат.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеОтправителя = otus_kafka.СоздатьОтправителя();
	Если НЕ ДанныеОтправителя.Успешно Тогда
		// обработка ошибки, запись в РС "ошибки интеграции" или ЖР
		Возврат;
	КонецЕсли;
	
	
	Пока Результат.Следующий() Цикл
		
		ОтправительИнициализирован = ДанныеОтправителя.Producer.Initialize(Результат.Адрес, Результат.Топик, -1);
		Если ОтправительИнициализирован <> Истина Тогда 
			стрОписаниеОшибки = ДанныеОтправителя.Producer.ErrorDescription;
			// аналогично обработка ошибки
			Продолжить;
		КонецЕсли;
		
		ОбработанныеЗаписи = Новый Массив();
		
		мДанныеНаЗапись = Новый Массив();
		ВыборкаЗаписи = Результат.Выбрать();
		
		Пока ВыборкаЗаписи.Следующий() Цикл
		
			ЗаписьJSON = Новый ЗаписьJSON();
			ЗаписьJSON.УстановитьСтроку();
			СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON, ВыборкаЗаписи.Объект.ПолучитьОбъект());
			ТекстСообщения = ЗаписьJSON.Закрыть();
			
			мЗаголовки = Новый Массив();
			мДанныеНаЗапись.Добавить(Новый Структура("Key, Value, Headers", XMLСтрока(ВыборкаЗаписи.Объект), ТекстСообщения, мЗаголовки));
		
			ОбработанныеЗаписи.Добавить(ВыборкаЗаписи.ИдентификаторЗаписи);		
			
		КонецЦикла;
		
		ВремяНачалаОтправки = ОценкаПроизводительности.НачатьЗамерВремени();
		
		ОтправкаУспешна = ОтправитьМассивДанныхВKafka(ДанныеОтправителя.Producer, мДанныеНаЗапись);
		Если НЕ ОтправкаУспешна Тогда
			Продолжить;
		КонецЕсли;		
		ОценкаПроизводительности.ЗакончитьЗамерВремени("ОтправкаДанныхВKafka", ВремяНачалаОтправки);
		
		Для Каждого УидЗаписи Из ОбработанныеЗаписи Цикл
			
			НаборЗаписей = РегистрыСведений.otus_СообщенияКОтправке.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ИдентификаторЗаписи.Установить(УидЗаписи);
			НаборЗаписей.Прочитать();		
			Для Каждого СтрокаЗаписи Из НаборЗаписей Цикл
				
				Если СтрокаЗаписи.Обработано Тогда
					Продолжить;
				КонецЕсли;
				
				СтрокаЗаписи.Обработано = Истина;
				СтрокаЗаписи.ДатаОбработки = ТекущаяДатаСеанса();
			КонецЦикла;				
			НаборЗаписей.Записать(Истина);    
			
		КонецЦикла;
		
		
	КонецЦикла;
	
	
	
КонецПроцедуры

Функция ОтправитьМассивДанныхВKafka(Producer, мДанныеНаЗапись) Экспорт 

	сткРезультатПреобразования = otus_ОбщегоНазначения.СтруктуруВJSON(мДанныеНаЗапись);   
	стрДанные = "" + сткРезультатПреобразования.стрДанные;
	
	РезультатПодготовкиСпискаНаОтправку = otus_kafka.Отправитель_ЗагрузитьСообщенияИзJSONВСписокНаОтправку(стрДанные, Producer);
	
	Если НЕ РезультатПодготовкиСпискаНаОтправку.Успешно Тогда
		стрОписаниеОшибки = РезультатПодготовкиСпискаНаОтправку.стрОписаниеОшибки;
		// обработка ошибки
		Возврат Ложь;
	КонецЕсли; 
	
	Возврат otus_kafka.ОтправитьСообщение(Producer);
	
КонецФункции


Процедура otus_ПрочитатьСообщения() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	otus_СоединенияСостав.Ссылка КАК Соединение,
						  | otus_СоединенияСостав.Ссылка.Адрес КАК Адрес,
						  |	otus_СоединенияСостав.ИмяОчереди КАК ИмяОчереди, 
						  |	otus_СоединенияСостав.Группа КАК Группа,
						  |	otus_СоединенияСостав.ТипОбъекта
	                      |ИЗ
	                      |	Справочник.otus_Соединения.Состав КАК otus_СоединенияСостав
	                      |ГДЕ
	                      |	otus_СоединенияСостав.Ссылка.Активно
	                      |	И otus_СоединенияСостав.Активно
						  |	И otus_СоединенияСостав.НаправлениеОбмена = ЗНАЧЕНИЕ(Перечисление.otus_НаправленияОбмена.Получение)");
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;	
	
	ДанныеПолучателя = otus_kafka.СоздатьПолучателя();
	Если НЕ ДанныеПолучателя.Успешно Тогда
		// обработка ошибки, запись в РС "ошибки интеграции" или ЖР
		Возврат;
	КонецЕсли;
	otus_kafka.Получатель_УстановитьПараметрыПоУмолчанию(ДанныеПолучателя.Consumer);
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
			
		ПолучательИнициализирован = ДанныеПолучателя.Consumer.Инициализация(Выборка.Адрес, Выборка.Группа);
		Если ПолучательИнициализирован <> Истина Тогда 
			стрОписаниеОшибки = ДанныеПолучателя.Consumer.ErrorDescription;
			// обработка ошибки
			Продолжить;
		КонецЕсли;
		
		мТопики = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Выборка.ИмяОчереди);
		сткРезультат = otus_kafka.Получатель_Подписаться(мТопики, ДанныеПолучателя.Consumer);
		Если Не сткРезультат.Успешно Тогда
			стрОписаниеОшибки = сткРезультат.стрОписаниеОшибки;	
			// обработка ошибки
			Продолжить;
		КонецЕсли;
		
		ТипОбъекта = Тип(СтрЗаменить(Выборка.ТипОбъекта, ".", "Объект.")); 
		
		ВремяНачалаЧтения = ОценкаПроизводительности.НачатьЗамерВремени();
		
		РезультатЧтения = otus_kafka.ПрочитатьСообщение(ДанныеПолучателя.Consumer); 
		
		ОценкаПроизводительности.ЗакончитьЗамерВремени("ПолучениеДанныхИзKafka", ВремяНачалаЧтения);
		
		Если РезультатЧтения.Успешно Тогда
			
			Для Каждого Строка Из РезультатЧтения.Данные Цикл
				СтрокаДанные = Строка.value;
				чтение = Новый ЧтениеJSON();
				чтение.УстановитьСтроку(СтрокаДанные);
				ДокОбъект = СериализаторXDTO.ПрочитатьJSON(чтение, ТипОбъекта);   
				ДокОбъект.ОбменДанными.Загрузка = Истина;
				ДокОбъект.Записать();
				
			КонецЦикла;
			
		КонецЕсли;
			
		
	КонецЦикла;
		
	
	
КонецПроцедуры
